Natnatee/CH32V003F4P6_REMOTE/src/main.c
                        // สั่งยิงสัญญาณ IR 38kHz ออกขา PD4 ทันทีถ้ามีโค้ด
                        if (code != 0) {
                            ir_send_code(code);
                        } else {
                            printf("[IR TX] Button %d is EMPTY (No Code)\r\n", key);
                        }
                    }

                    get_footer_str(footer_buf, current_mode, current_profile);

                    // สั่งกระพริบช่องปุ่ม 3 ครั้ง
                    for (int blink = 0; blink < 3; blink++)
                    {
                        oled_render_grid_screen(current_profile_name, footer_buf, key, 1, active_codes);
                        Delay_Ms(70);
                        oled_render_grid_screen(current_profile_name, footer_buf, key, 0, active_codes);
                        Delay_Ms(70);
                    }
                }
            }
        }
        else if (key == 0)
        {
            last_key = 0;
        }

        // --- 4. การกระพริบ Cursor ในโหมด RENAME และกระพริบ Footer ในหน้า Mode Select ---
        blink_tick++;
        if (blink_tick >= 15)
        {
            blink_tick = 0;
            mode_blink_state = !mode_blink_state;

            if (mode_select_active)
            {
                if (mode_blink_state)
                {
                    oled_render_grid_screen(current_profile_name, mode_select_labels[selected_mode], 0, 0, active_codes);
                }
                else
                {
                    oled_render_grid_screen(current_profile_name, "", 0, 0, active_codes);
                }
            }
            else if (current_mode == MODE_RENAME && rename_editing)
            {
                oled_render_rename_screen(edit_name_buf, rename_cursor, mode_blink_state, current_profile, 1);
            }
        }

        Delay_Ms(20);
    }
}
